<?php

namespace Database\Seeders;

use App\Models\EnergyCompany;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class EnergyCompanySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        // Масив з даними компаній
        $companies = [
            ['name' => 'АК "Житомиробленерго"', 'u_code' => 'MGA-01600'],
            ['name' => 'АТ "Вінницяобленерго"', 'u_code' => 'MGA-00100'],
            ['name' => 'АТ "ДТЕК ДНІПРОВСЬКІ ЕЛЕКТРОМЕРЕЖІ"', 'u_code' => 'MGA-00200'],
            ['name' => 'АТ "ДТЕК ДОНЕЦЬКІ ЕЛЕКТРОМЕРЕЖІ"', 'u_code' => 'MGA-02400'],
            ['name' => 'АТ "ДТЕК ОДЕСЬКІ ЕЛЕКТРОМЕРЕЖІ"', 'u_code' => 'MGA-01000'],
            ['name' => 'АТ "Миколаївобленерго"', 'u_code' => 'MGA-00400'],
            ['name' => 'АТ "Полтаваобленерго"', 'u_code' => 'MGA-01100'],
            ['name' => 'АТ "Сумиобленерго"', 'u_code' => 'MGA-02300'],
            ['name' => 'АТ "Харківобленерго"', 'u_code' => 'MGA-01200'],
            ['name' => 'АТ "Херсонобленерго"', 'u_code' => 'MGA-01400'],
            ['name' => 'АТ "Хмельницькобленерго"', 'u_code' => 'MGA-01800'],
            ['name' => 'АТ "Чернівціобленерго"', 'u_code' => 'MGA-01300'],
            ['name' => 'АТ "Чернігівобленерго"', 'u_code' => 'MGA-02000'],
            ['name' => 'ВАТ "Тернопільобленерго"', 'u_code' => 'MGA-02500'],
            ['name' => 'ДП "Регіональні електричні мережі"', 'u_code' => 'MGA-02800'],
            ['name' => 'ДПЕМ ПрАТ "Атомсервіс"', 'u_code' => 'MGA-01700'],
            ['name' => 'КП "Міські електричні мережі"', 'u_code' => 'MGA-03100'],
            ['name' => 'ПАТ "ДТЕК ПЕМ-Енерговугілля"', 'u_code' => 'MGA-03200'],
            ['name' => 'ПАТ "Запоріжжяобленерго"', 'u_code' => 'MGA-00700'],
            ['name' => 'ПАТ "Українська залізниця"', 'u_code' => 'MGA-02900'],
            ['name' => 'ПАТ "Черкасиобленерго"', 'u_code' => 'MGA-01900'],
            ['name' => 'ПрАТ "Волиньобленерго"', 'u_code' => 'MGA-00600'],
            ['name' => 'ПрАТ "ДТЕК Київські електромережі"', 'u_code' => 'MGA-03000'],
            ['name' => 'ПрАТ "ДТЕК КИЇВСЬКІ РЕГІОНАЛЬНІ ЕЛЕКТРОМЕРЕЖІ"', 'u_code' => 'MGA-02200'],
            ['name' => 'ПрАТ "Закарпаттяобленерго"', 'u_code' => 'MGA-00701'],
            ['name' => 'ПрАТ "Кіровоградобл."', 'u_code' => 'MGA-02100'],
            ['name' => 'ПрАТ "Львівобленерго"', 'u_code' => 'MGA-00900'],
            ['name' => 'ПрАТ "ПЕЕМ "ЦЕК"', 'u_code' => 'MGA-02700'],
            ['name' => 'ПрАТ "Прикарпаттяобленерго"', 'u_code' => 'MGA-00800'],
            ['name' => 'ПрАТ "Рівнеобленерго"', 'u_code' => 'MGA-01500'],
        ];

        // Проходимо по масиву і створюємо записи в базі даних
        foreach ($companies as $company) {
            EnergyCompany::create($company);
        }
    }
}